# save_csv

In [1]:
import csv

In [32]:
# file open, newline = ''으로 개행문자 지정
with open('top_cities.csv', 'w', encoding='utf-8', newline='') as f:
    # csv.writer는 파일 객체를 매개 변수로 지정
    writer = csv.writer(f)
    # 첫 번째 줄에는 헤더를 작성
    writer.writerow(['rank', 'city', 'population'])
    # writerrows()에 리스트를 전달하면 여러 개의 값을 출력
    writer.writerow([
        [1, '상하이', 24150000],
        [2, '카라치', 23500000],
        [3, '베이징', 21516000],
        [4, '텐진', 14722100],
        [5, '이스탄불', 14160467],
        ])

---
# save_csv_dict

In [33]:
import csv

In [34]:
with open('top_cities.csv', 'w', newline='') as f:
    # 첫 번째 매개변수에는 파일 객체
    # 두 번째 매개변수에는 필드명 리스트를 지정
    writer = csv.DictWriter(f, ['rank', 'city', 'population'])
    # 첫 번째 줄에 헤더 입력
    writer.writeheader()
    # writerows()로 여러 개의 데이터를 딕셔너리 형태로 작성
    writer.writerows([
        {'rank': 1, 'city':'상하이', 'population':24150000},
        {'rank': 2, 'city':'카라치', 'population':23500000},
        {'rank': 3, 'city':'베이징', 'population':21516000},
        {'rank': 4, 'city':'텐진',   'population':14622100},
        {'rank': 5, 'city':'이스탄불', 'population':14160467},
    ])

In [70]:
result = pd.read_csv('top_cities.csv', encoding='utf-8', index_col=False)
result

   rank  city  population
0     1   상하이    24150000
1     2   카라치    23500000
2     3   베이징    21516000
3     4    텐진    14622100
4     5  이스탄불    14160467

---
# encoding_check

In [44]:
import csv

In [49]:
with open('top_cities.csv', 'w', newline='', encoding='utf-8') as f:
    # 첫 번째 매개변수에는 파일 객체
    # 두 번째 매개변수에는 필드명 리스트를 지정
    writer = csv.DictWriter(f, ['rank', 'city', 'population'])
    # 첫 번째 줄에 헤더 입력
    writer.writeheader()
    # writerows()로 여러 개의 데이터를 딕셔너리 형태로 작성
    writer.writerows([
        {'rank': 1, 'city':'상하이', 'population':24150000},
        {'rank': 2, 'city':'카라치', 'population':23500000},
        {'rank': 3, 'city':'베이징', 'population':21516000},
        {'rank': 4, 'city':'텐진',   'population':14622100},
        {'rank': 5, 'city':'이스탄불', 'population':14160467},
    ])

In [50]:
import chardet

In [51]:
char_dic = chardet.detect(open('top_cities.csv', 'rb').read())

In [52]:
char_dic['encoding']

'utf-8'

---
# save_json

In [57]:
import json

In [58]:
cities = [ 
{'rank': 1, 'city':'상하이', 'population': 24150000},
{'rank': 2, 'city':'카라치', 'population': 23500000},
{'rank': 3, 'city':'베이징', 'population': 21516000},
{'rank': 4, 'city':'텐진', 'population': 14722100}, 
{'rank': 5, 'city':'이스탄불', 'population':14160467},
]

In [59]:
with open('top_cities.json', 'w') as fw:
    json.dump(cities, fw)

In [60]:
with open('top_cities.json', 'r') as fr:
    json_file = json.load(fr)
    print(json_file)

[{'rank': 1, 'city': '상하이', 'population': 24150000}, {'rank': 2, 'city': '카라치', 'population': 23500000}, {'rank': 3, 'city': '베이징', 'population': 21516000}, {'rank': 4, 'city': '텐진', 'population': 14722100}, {'rank': 5, 'city': '이스탄불', 'population': 14160467}]

---
# save_sqlite3

In [61]:
import pandas as pd
import sqlite3
from pandas.io import sql
import os

In [62]:
DB_NAME = 'top_cities.db'
TABLE_NAME = 'TOP_CITIES'

In [ ]:
def db_save(df, db_name, table_name):
    with sqlite3.connect(db_name) as con:
        try:
            df.to_sql(name = table_name, con = con, index=False, if_exists='append')
            #if_exists : {'fail', 'replace', 'append'} default : fail
        except Exception as e:
            print(str(e))
        print(len(df), '건 저장완료..')

In [100]:
db_save(result, DB_NAME, TABLE_NAME)

5 건 저장완료..

In [78]:
def db_select(df, db_name, table_name):
    with sqlite3.connect(db_name) as con:
        try:
            query = 'SELECT * FROM {}'.format(table_name)
            df = pd.read_sql(query, con = con)
        except Exception as e:
            print(str(e))
        return df

In [97]:
def db_delete(df, db_name, table_name):
    with sqlite3.connect(db_name) as con:
        try:
            cur = con.cursor()
            sql = 'DELETE FROM {}'.format(table_name)
            cur.execute(sql)
        except Exception as e:
            print(str(e))

In [101]:
db_select(result, DB_NAME, TABLE_NAME)

   rank  city  population
0     1   상하이    24150000
1     2   카라치    23500000
2     3   베이징    21516000
3     4    텐진    14622100
4     5  이스탄불    14160467

In [98]:
db_delete(result, DB_NAME, TABLE_NAME)

no such table: TOP_CITIES

---
# 데이터프레임 생성되는지 확인

In [67]:
con = sqlite3.connect(DB_NAME)

In [73]:
pd.read_sql('select * from "TOP_CITIES"', con)

   rank  city  population
0     1   상하이    24150000
1     2   카라치    23500000
2     3   베이징    21516000
3     4    텐진    14622100
4     5  이스탄불    14160467

In [69]:
pd.read_json('top_cities.json')

   rank  city  population
0     1   상하이    24150000
1     2   카라치    23500000
2     3   베이징    21516000
3     4    텐진    14722100
4     5  이스탄불    14160467

In [74]:
pd.read_csv('top_cities.csv', encoding='utf-8')

   rank  city  population
0     1   상하이    24150000
1     2   카라치    23500000
2     3   베이징    21516000
3     4    텐진    14622100
4     5  이스탄불    14160467